**`teams/oasys/oracle_db`** terragrunt plan on `pull_request` event [#147](${url})

```
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/oasys-oracle-db"
        name         = "oasys_oracle_db"
      ~ tags         = {
          ~ "image-recipe"                 = "oasys_oracle_db/0.0.6" -> "oasys_oracle_db/0.0.7"
          ~ "infrastructure-configuration" = "oasys_oracle_db/0.0.6" -> "oasys_oracle_db/0.0.7"
          ~ "os-version"                   = "rhel 8.5" -> "oracle linux 8.5"
          - "update-linux-version"         = "1.0.2" -> null
            # (8 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "image-recipe"                 = "oasys_oracle_db/0.0.6" -> "oasys_oracle_db/0.0.7"
          ~ "infrastructure-configuration" = "oasys_oracle_db/0.0.6" -> "oasys_oracle_db/0.0.7"
          ~ "os-version"                   = "rhel 8.5" -> "oracle linux 8.5"
          - "update-linux-version"         = "1.0.2" -> null
            # (8 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/oasys-oracle-db" -> (known after apply)
      ~ date_created                     = "2023-05-17T09:47:27.872Z" -> (known after apply)
      ~ date_last_run                    = "2023-06-02T00:00:16.670Z" -> (known after apply)
      ~ date_next_run                    = "2023-07-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2023-05-17T09:47:27.872Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/oasys-oracle-db" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/oasys-oracle-db/0.0.6" -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/oasys-oracle-db-0-0-6" -> (known after apply)
        name                             = "oasys_oracle_db"
      ~ platform                         = "Linux" -> (known after apply)
      ~ tags                             = {
          ~ "image-recipe"                 = "oasys_oracle_db/0.0.6" -> "oasys_oracle_db/0.0.7"
          ~ "infrastructure-configuration" = "oasys_oracle_db/0.0.6" -> "oasys_oracle_db/0.0.7"
          ~ "os-version"                   = "rhel 8.5" -> "oracle linux 8.5"
          - "update-linux-version"         = "1.0.2" -> null
            # (8 unchanged elements hidden)
        }
      ~ tags_all                         = {
          ~ "image-recipe"                 = "oasys_oracle_db/0.0.6" -> "oasys_oracle_db/0.0.7"
          ~ "infrastructure-configuration" = "oasys_oracle_db/0.0.6" -> "oasys_oracle_db/0.0.7"
          ~ "os-version"                   = "rhel 8.5" -> "oracle linux 8.5"
          - "update-linux-version"         = "1.0.2" -> null
            # (8 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/oasys-oracle-db/0.0.6" -> (known after apply)
      ~ date_created      = "2023-05-17T09:47:26.828Z" -> (known after apply)
      ~ id                = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/oasys-oracle-db/0.0.6" -> (known after apply)
        name              = "oasys_oracle_db"
      ~ owner             = "374269020027" -> (known after apply)
      ~ platform          = "Linux" -> (known after apply)
      ~ tags              = {
          ~ "image-recipe"                 = "oasys_oracle_db/0.0.6" -> "oasys_oracle_db/0.0.7"
          ~ "infrastructure-configuration" = "oasys_oracle_db/0.0.6" -> "oasys_oracle_db/0.0.7"
          ~ "os-version"                   = "rhel 8.5" -> "oracle linux 8.5"
          - "update-linux-version"         = "1.0.2" -> null
            # (8 unchanged elements hidden)
        }
      ~ tags_all          = {
          ~ "image-recipe"                 = "oasys_oracle_db/0.0.6" -> "oasys_oracle_db/0.0.7"
          ~ "infrastructure-configuration" = "oasys_oracle_db/0.0.6" -> "oasys_oracle_db/0.0.7"
          ~ "os-version"                   = "rhel 8.5" -> "oracle linux 8.5"
          - "update-linux-version"         = "1.0.2" -> null
            # (8 unchanged elements hidden)
        }
      ~ user_data_base64  = "" -> (known after apply)
      ~ version           = "0.0.6" -> "0.0.7" # forces replacement
      - working_directory = "" -> null
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sdb" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 100 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdb"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 100
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdc" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 500 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdc"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 500
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sde" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 200 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sde"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 200
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdj" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 50 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdj"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 50
              + volume_type           = "gp3"
            }
        }

      ~ component { # forces replacement
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:aws:component/update-linux/x.x.x" -> "arn:aws:imagebuilder:eu-west-2:374269020027:component/ansible/0.0.6" # forces replacement

          + parameter { # forces replacement
              + name  = "Ami"
              + value = "oasys_oracle_db"
            }
          + parameter { # forces replacement
              + name  = "Branch"
              + value = "main"
            }
        }
      - component { # forces replacement
          - component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/ansible/0.0.6" -> null # forces replacement

          - parameter { # forces replacement
              - name  = "Ami" -> null
              - value = "oasys_oracle_db" -> null
            }
          - parameter { # forces replacement
              - name  = "Branch" -> null
              - value = "main" -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/oasys-oracle-db-0-0-6" -> (known after apply)
      ~ date_created                  = "2023-05-17T09:47:26.787Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/oasys-oracle-db-0-0-6" -> (known after apply)
      ~ name                          = "oasys_oracle_db_0_0_6" -> "oasys_oracle_db_0_0_7" # forces replacement
      ~ resource_tags                 = {
          ~ "image-recipe"                 = "oasys_oracle_db/0.0.6" -> "oasys_oracle_db/0.0.7"
          ~ "infrastructure-configuration" = "oasys_oracle_db/0.0.6" -> "oasys_oracle_db/0.0.7"
          ~ "os-version"                   = "rhel 8.5" -> "oracle linux 8.5"
          - "update-linux-version"         = "1.0.2" -> null
            # (8 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "image-recipe"                 = "oasys_oracle_db/0.0.6" -> "oasys_oracle_db/0.0.7"
          ~ "infrastructure-configuration" = "oasys_oracle_db/0.0.6" -> "oasys_oracle_db/0.0.7"
          ~ "os-version"                   = "rhel 8.5" -> "oracle linux 8.5"
          - "update-linux-version"         = "1.0.2" -> null
            # (8 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "image-recipe"                 = "oasys_oracle_db/0.0.6" -> "oasys_oracle_db/0.0.7"
          ~ "infrastructure-configuration" = "oasys_oracle_db/0.0.6" -> "oasys_oracle_db/0.0.7"
          ~ "os-version"                   = "rhel 8.5" -> "oracle linux 8.5"
          - "update-linux-version"         = "1.0.2" -> null
            # (8 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

```
